{
	"@metadata": {
		"authors": [
			"Daimona Eaytoy"
		]
	},
	"campaignevents-desc": "{{desc|name=CampaignEvents|url=https://www.mediawiki.org/wiki/Extension:CampaignEvents}}",
	"action-campaignevents-create-registration": "{{doc-action|campaignevents-create-registration}}",
	"right-campaignevents-create-registration": "{{doc-right|campaignevents-create-registration}}",
	"campaignevents-error-invalid-id": "Error message used when the given event ID is not valid.",
	"campaignevents-error-empty-name": "Error message used when the given event name is empty.",
	"campaignevents-error-name-too-long": "Error message used when the given event name is too long.\nParameters:\n* $1 - The maximum allowed length",
	"campaignevents-error-empty-title": "Error message used when the given event page title is an empty string.",
	"campaignevents-error-invalid-title": "Error message used when the given event page title is invalid.\nParameters:\n* $1 - The reason why the title is not valid",
	"campaignevents-error-invalid-title-interwiki": "Error message used when the given event page title has an unknown interwiki prefix.",
	"campaignevents-error-page-not-found": "Error message used when the given event page does not exist.",
	"campaignevents-error-invalid-chat-url": "Error message used when the given chat URL is invalid.",
	"campaignevents-error-tracking-tool-name-without-url": "Error message used when a tracking tool name is given, but not a tracking tool URL.",
	"campaignevents-error-tracking-tool-url-without-name": "Error message used when a tracking tool URL is given, but not a tracking tool name.",
	"campaignevents-error-invalid-trackingtool-url": "Error message used when the given tracking tool URL is invalid.",
	"campaignevents-error-invalid-status": "Error message used when the given event status is invalid.",
	"campaignevents-error-empty-start": "Error message used when the given event start date is empty.",
	"campaignevents-error-invalid-start": "Error message used when the given event start date is invalid.",
	"campaignevents-error-start-past": "Error message used when the given start date is in the past.",
	"campaignevents-error-empty-end": "Error message used when the given event end date is empty.",
	"campaignevents-error-invalid-end": "Error message used when the given event end date is invalid.",
	"campaignevents-error-start-after-end": "Error message used when the start date of an event is after the end date.",
	"campaignevents-error-invalid-type": "Error message used when the given event type is invalid.",
	"campaignevents-error-no-meeting-type": "Error message used when no event meeting type was specified.",
	"campaignevents-error-online-no-meeting-url": "Error message used when the \"online\" event type is selected but no meeting link was provided.",
	"campaignevents-error-invalid-meeting-url": "Error message used when the given event meeting URL is invalid.",
	"campaignevents-error-physical-no-country": "Error message used when the \"physical\" event type is selected but no country was provided.",
	"campaignevents-error-physical-no-address": "Error message used when the \"physical\" event type is selected but no address was provided.",
	"campaignevents-error-invalid-country": "Error message used when the given event country is invalid.",
	"campaignevents-error-invalid-address": "Error message used when the given event address URL is invalid.",
	"campaignevents-rest-createevent-permission-denied": "Error message used when an unauthorized user attempts to create an event registration.",
	"campaignevents-rest-createevent-permission-denied-page": "Error message used when an unauthorized user attempts to create an event registration for a specific page."
}
